<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <meta http-equiv="content-type"
 content="text/html; charset=ISO-8859-1">
  <title>WWW-Anmeldung f&uuml;r PICA</title>
</head>
<body>
<h2 style="text-align: center;">WWW-basierte Benutzeranmeldung <br>
f&uuml;r das PICA-System<br>
</h2>
<div style="text-align: center;">Martin Butkus
&lt;mb@buch.biblio.etc.tu-bs.de&gt;<br>
Universit&auml;tsbibliothek Braunschweig<br>
<br>
Mai 2004<br>
</div>
<h3>Einf&uuml;hrung</h3>
Die Bibliotheks-Software PICA [<a href="#1">1</a>] wird&nbsp; im
Bibliotheksverbund
GBV [<a href="#2">2</a>] unter anderem f&uuml;r die Verwaltung der
Nutzerkonten
eingesetzt. In der aktuellen Version 3 verf&uuml;gt dieses Programm
jedoch von Haus aus nicht &uuml;ber die M&ouml;glichkeit einer
Benutzeranmeldung &uuml;ber ein Web-Interface. <br>
<br>
In der Regel sind im Benutzerbereich einer Bibliothek, die PICA
einsetzt, bereits mehrere PCs vorhanden, die f&uuml;r die Recherche im
Online-Katalog eingesetzt werden. Diese k&ouml;nnten ohne weiteren
Mehraufwand als Eingabe-Terminals f&uuml;r eine Online-Anmeldung
mitgenutzt werden. Die Dateneingabe erfolgt dann durch den Benutzer
unmittelbar in elektronischer Form. Zus&auml;tzlich kann auch eine
Anmeldung &uuml;ber das Internet leicht realisiert werden. Eine
derartige elektronische Anmeldung bietet etwa gegen&uuml;ber dem
Einsatz von
Papierformularen insbesondere die folgenden Vorteile:<br>
<ul>
  <li>die Entlastung des Bibliothekspersonals von der manuellen
Dateneingabe</li>
  <li>eine&nbsp; maschinelle Plausibilit&auml;tskontrolle der
Eingabedaten</li>
  <li>die &Uuml;berpr&uuml;fung aller Eingaben durch den Benutzer selbst<br>
  </li>
  <li>die&nbsp; (halb-)automatische Erstellung eines PICA-Datensatzes<br>
  </li>
  <li>eine insgesamt deutlich z&uuml;gigere Abwicklung des
Anmeldeverfahrens<br>
  </li>
</ul>
Im Zuge einer Modernisierung der Gesch&auml;ftsg&auml;nge wurde an der
Universit&auml;tsbibliothek Braunschweig ein Modul entwickelt, das eine
solche Online-Anmeldung realisiert. Das Modul basiert g&auml;nzlich auf
"Open Source"-Software [<a href="#3">3</a>], die frei von
Lizenzkosten&nbsp; und entsprechend preiswert in der Beschaffung
ist.&nbsp; Es
handelt sich um ein sogenanntes "LAMP"-System, da es auf dem
Betriebssystem <span style="font-weight: bold;">L</span>inux, dem
Webserver <span style="font-weight: bold;">A</span>pache [<a href="#4">4</a>],
der
Datenbank <span style="font-weight: bold;">M</span>ySQL [<a href="#5">5</a>]
sowie - im
Wesentlichen - auf der Skriptsprache <span style="font-weight: bold;">P</span>HP
&nbsp;[<a href="#6">6</a>] basiert. (Einige wenige Programmteile sind
in Perl geschrieben.)<br>
<br>
Trotz der Konzeption als "LAMP"-System ist das Anmeldungs-Modul auch
auf diversen
anderen Betriebssystemen (z.B. Windows, Mac OS X, Solaris) und mit
anderen Webservern (z.B. Xitami, IIS, u.&auml;.) lauff&auml;hig.
<h3>Highlights</h3>
<ul>
  <li><span style="font-weight: bold;">benutzerfreundlich</span><br>
    <br>
Mehrseitiges, &uuml;bersichtliches Formular, in dem bequem vor- und
zur&uuml;ckgebl&auml;ttert werden kann. Automatische
Plausibilit&auml;tskontrolle aller Eingaben anhand von frei
konfigurierbaren Textmustern ("Regular Expressions").<br>
    <br>
  </li>
  <li><span style="font-weight: bold;">mehrsprachig</span><br>
    <br>
Es stehen eine deutsche und eine englische Eingabemaske zur
Verf&uuml;gung. Zwischen beiden Varianten kann w&auml;hrend der Eingabe
gewechselt werden.Weitere Sprachen lassen sich vom Administrator leicht
hinzuf&uuml;gen.<br>
    <br>
  </li>
  <li><span style="font-weight: bold;">sicher</span><br>
    <br>
Es existiert eine strikte programmtechnische Trennung zwischen dem
"&ouml;ffentlichen"
Webformular, dem "administrativen" Webformular (passwortgesch&uuml;tzt,
nur
f&uuml;r Bibliotheksmitarbeiter) und der PICA-Datenbank. Das
"&ouml;ffentliche"
Webformular hat dabei keinerlei Zugriff auf die
PICA-Datenbank.&nbsp;&nbsp; F&uuml;r die
Speicherung der Antragsdaten und die Kommunikation zwischen
&ouml;ffentlichem und internen Webformular wird eigens f&uuml;r diesen
Zweck eine separate MySQL-Datenbank verwendet.<br>
    <br>
  </li>
  <li><span style="font-weight: bold;">konfigurierbar</span><br>
    <br>
S&auml;mtliche Text-Ausgaben und Eingabefelder lassen sich an einer
zentralen Stelle im Skript anpassen. Die Ausgaben sind als SQL-Abfragen
realisiert, und lassen sich ebenso einfach modifizieren. Geplant ist
ferner die Einf&uuml;hrung von "Hook"-Funktionen, um eigene
Code-Anpassungen zu erleichtern.<br>
    <br>
  </li>
  <li><span style="font-weight: bold;">erweiterbar</span><br>
    <br>
Dank einer weitgehenden Modularisierung und einer ausf&uuml;hrlichen
Quelltext-Dokumentation&nbsp; lassen sich eigene Erweiterungen ohne
gr&ouml;&szlig;eren Aufwand
realisieren.<br>
    <br>
  </li>
  <li><span style="font-weight: bold;">kosteng&uuml;nstig</span><br>
    <br>
Dank der ausschlie&szlig;lichen Verwendung von Open-Source-Software
fallen keine zus&auml;tzliche Lizenzkosten f&uuml;r diese L&ouml;sung
an.&nbsp;<br>
  </li>
</ul>
<h3>Alternativen</h3>
<ul>
  <li>Eine Anfrage auf der Mailingliste INETBIB vom M&auml;rz 2004
ergab zwei Bibliotheken im deutschsprachigen Raum, die
&auml;hnliche, selbst entwickelte L&ouml;sungen bereits im Einsatz
haben. Keines dieser Systeme scheint jedoch eine weitere Verbreitung
gefunden zu haben. <br>
    <br>
In beiden F&auml;llen wurde auf eine Zwischenspeicherung der
Anmeldungen in einer eigenen Datenbank verzichtet; stattdessen wurde
der Datensatz unmittelbar nach der Benutzereingabe in die
PICA-Datenbank importiert. Dies halten wir f&uuml;r einen gravierenden
Nachteil, wie wir weiter unten genauer darlegen werden. <br>
    <br>
  </li>
  <li>In einigen GBV-Bibliotheken wird bereits der maschinelle Import
von
Benutzerdaten aus externen Quellen (z.B. Immatrikulationsamt)
praktiziert. Oftmals werden dadurch jedoch bestimmte Benutzergruppen -
etwa Gastwissenschaftler und au&szlig;eruniversit&auml;re Benutzer -
nicht erfa&szlig;t, und m&uuml;ssen sich daher weiterhin per Formular
anmelden. In diesem Fall stellt eine Kombination von automatischem
Datenimport und der Online-Anmeldung (f&uuml;r nicht erfa&szlig;te
Nutzergruppen) eine einfache und elegante L&ouml;sung dar. <br>
  </li>
</ul>
<h3>Ablauf einer Online-Anmeldung<br>
</h3>
<h4>Dateneingabe<br>
</h4>
Der Benutzer gibt seine Daten an einem Eingabe-Terminal (Katalog-PC)
oder &uuml;ber das Internet ein. Das Formular besteht aus mehreren
Seiten; ein Vor- und Zur&uuml;ckbl&auml;ttern ist m&ouml;glich. Es ist
mit einer Plausibilit&auml;tskontrolle versehen:
Dateneingaben werden bei der Eingabe anhand von Textmustern
&uuml;berpr&uuml;ft; ung&uuml;ltige Eingaben werden
zur&uuml;ckgewiesen,
und der Benutzer &uuml;ber die Art des Fehlers informiert. Das Formular
ist multilingual (deutsch/englisch); zwischen den Sprachen kann zu
jeder
Zeit gewechselt werden. Weitere Sprachen lassen sich leicht
nachr&uuml;sten.<br>
<br>
<img src="img/screen1.gif" alt="" style="width: 702px; height: 649px;"><br>
<br>
Nach der Eingabe werden die Daten nochmals in Tabellenform
zusammengefa&szlig;t dargestellt, und der Benutzer erh&auml;lt eine
letzte M&ouml;glichkeit zur Korrektur des Datensatzes.
<h4>Zwischenspeicherung in einer Datenbank (MySQL)<br>
</h4>
Wenn der Benutzer den Datensatz absendet, wird dieser in einer
MySQL-Datenbank zwischengespeichert. Diese Datenbank ist
unabh&auml;ngig
vom PICA-System; sie dient allein der Speicherung der neu
erfa&szlig;ten
Anmeldungen.&nbsp; Der Benutzer wird aufgefordert, sich bei der
Leihtheke zu melden, um seinen Benutzungsausweis zu erhalten. <br>
<br>
Durch die Verwendung einer separaten Datenbank - statt einer
unmittelbaren &Uuml;bernahme in die PICA-Datenbank -&nbsp; wird
gew&auml;hrleistet, da&szlig; sich tats&auml;chlich nur korrekte Daten
von <span style="font-style: italic;">aktiven </span>Benutzer in der
PICA-Datenbank befinden, da vor der &Uuml;bernahme die Personalien des
Benutzers &uuml;berpr&uuml;ft werden (siehe unten).<br>
<br>
Ein zweiter Aspekt ist die erh&ouml;hte Systemsicherheit. Da das
&ouml;ffentlich zug&auml;ngliche "Anmelde"-PHP-Skript nur Zugriff auf
die MySQL-Datenbank, jedoch <span style="font-style: italic;">nicht </span>auf
die PICA-Datenbank hat, &nbsp;sind die dort befindlichen Daten bei
einem Hacker-Angriff &nbsp;auf das Skript nicht gef&auml;hrdet.<br>
<h4>Verifikation und &Uuml;bernahme in die PICA-Datenbank<br>
</h4>
Der Benutzer will nun seinen Benutzungsausweis abholen. Der
Bibliotheksangestellte verf&uuml;gt &uuml;ber eine
pa&szlig;wortgesch&uuml;tzte&nbsp; "Administrator"-Weboberfl&auml;che,
&uuml;ber die er den Datensatz des Benutzers aufruft. <br>
<br>
<img src="img/screen4.gif" alt="" style="width: 702px; height: 583px;"><br>
<br>
Der Mitarbeiter &uuml;berpr&uuml;ft die Personalien, &nbsp;korrigiert
falls
n&ouml;tig den Datensatz, &nbsp;liest den Barcode des neuen
Nutzerausweises ein, und initiiert anschlie&szlig;end den Transfer des
Datensatzes in das PICA-System. Dieser Datentransfer ist innerhalb
weniger Sekunden abgeschlossen. <br>
<h4>Ausdruck des Anmeldeformulars<br>
</h4>
Aus rechtlichen Gr&uuml;nden mu&szlig; jeder Benutzer der UB
Braunschweig die Benutzungsordnung schriftlich anerkennen. Daher wurde
eine Funktion implementiert, die den Ausdruck eines ausgef&uuml;llten,
unterschriftsfertigen Formulars erlaubt. Diese wird nach dem
Datentransfer automatisch aufgerufen; es k&ouml;nnen jedoch noch
weitere Ausdrucke gefertigt werden. Der Text des Formulars
l&auml;&szlig;t sich frei anpassen.<br>
<span style="font-weight: bold;"></span><br>
Nachdem der Benutzer das Formular unterschrieben hat, erh&auml;lt er
seinen Nutzerausweis. Der Bibliotheksangestellte l&ouml;scht nun den
Datensatz in der MySQL-Datenbank. Der Anmeldevorgang ist damit
abgeschlossen.<br>
<h3><span style="font-weight: bold;">Technische Details</span><span
 style="font-weight: bold;"> zum PICA-Export</span></h3>
Vor Beginn des Datentransfers wird zun&auml;chst per SQL-Abfrage
&uuml;berpr&uuml;ft,
ob der betreffende Benutzer bereits in der PICA-Datenbank vorhanden
ist.&nbsp; Als Suchschl&uuml;ssel dienen der Nachname und
das Geburtsdatum des Benutzers. Falls passende Datens&auml;tze gefunden
werden, erscheint eine Warnmeldung. Der Bibliotheksmitarbeiter kann die
&Uuml;bernahme dann abbrechen, oder sie trotzdem fortsetzen.<br>
<br>
Der eigentliche Datentransfer erfolgt mittels des Hilfsprogramms <code>ousp_upd_borrower</code><code>
</code>[<a href="#7">7</a>],
das Bestandteil von PICA ist und den automatisierten Datenimport aus
Fremdquellen realisiert. Dieses &nbsp;Programm <code></code>funktioniert
jedoch nur korrekt, wenn es auf dem LBS-Datenbankserver unter der
Benutzer-ID <code>lbs_prod </code>l&auml;uft.<br>
<br>
Aus Sicherheitsgr&uuml;nden empfiehlt es sich generell, Webserver und
PICA-Datenbankserver auf separaten Rechnern zu betreiben. Da die
Administrator-Oberfl&auml;che auf dem Webserver l&auml;uft, mu&szlig;
es einen Mechanismus geben, der die Export-Datei auf den
Datenbankserver kopiert, und anschlie&szlig;end das o.g. Hilfsprogramm
aufruft. Dieser wird durch ein externes Programm realisiert, und ist
frei konfigurierbar.<br>
<br>
Wir haben dieses Problem mit Hilfe einer Client-Server-L&ouml;sung
gel&ouml;st:
<ul>
  <li>Auf dem PICA-Datenbankserver l&auml;uft ein Perl-Skript
&nbsp;unter der Benutzer-ID <code>lbs_prod</code>. Dieses Skript
fungiert als <span style="font-weight: bold;">Server</span>. Es
empf&auml;ngt zun&auml;chst ein Pa&szlig;wort, und anschlie&szlig;end
die Export-Datei. Aus Sicherheitsgr&uuml;nden sind nur bestimmte
Client-IP-Adressen zugelassen. Als zus&auml;tzliche
Sicherheitsma&szlig;nahme empfiehlt sich die Verschl&uuml;sselung der
Verbindung&nbsp; &uuml;ber einen SSH-Tunnel. <br>
    <br>
Der Server ist bewu&szlig;t als <span style="font-style: italic;">non-threading
    </span>Server
programmiert, das hei&szlig;t, da&szlig; er nur eine einzige
TCP/IP-Verbindung gleichzeitig bedienen kann. Falls mehrere Clients
eine Verbindung initiieren, so blockieren alle Clients bis auf einen.
Auf diese Weise wird gew&auml;hrleistet, da&szlig; immer nur eine
Instanz von <code>ousp_upd_borrower</code> gleichzeitig aktiv ist.<br>
    <br>
  </li>
  <li>Auf dem Webserver l&auml;uft das Gegenst&uuml;ck, der <span
 style="font-weight: bold;">Client</span>, derzeit ebenfalls ein
Perl-Skript. <br>
  </li>
</ul>
Fehlermeldungen von <code>ousp_upd_borrower </code>werden - ebenso
wie Netzwerk- und sonstige Fehler -&nbsp; erkannt, und resultieren in
einer Warnmeldung an den Benutzer.<br>
<h3>Probleme und Einschr&auml;nkungen</h3>
<ul>
  <li>In der Regel&nbsp; wird ein Administrator die Skripte an lokale
Gepflogenheiten und die jeweils gew&uuml;nschte Verwendung der Felder
anpassen wollen. Es wurde versucht, die Skripte so zu gestalten,
da&szlig; solche Anpassungen&nbsp; an zentralen Stellen konzentriert
werden, und damit auch ge&auml;ndert werden k&ouml;nnen, ohne in den
restlichen Programmcode einsteigen zu m&uuml;ssen. Einige im
Programmcode verstreute "Braunschweigensien" sind jedoch zur Zeit noch
vorhanden, und m&uuml;ssen noch beseitigt werden.<br>
    <br>
  </li>
  <li>Ein spezielles Problem betrifft das Feld "Registriernummer". Das
Import-Programm <code>ousp_upd_borrower</code> kennt zwei Arbeitsmodi:
"Datensatz neu anlegen" und "Datensatz aktualisieren". Es verwendet das
Feld "Registriernummer" als Prim&auml;rschl&uuml;ssel, um zwischen den
beiden Funktionen&nbsp; zu unterscheiden. Ein neuer Datensatz wird dann
(und nur dann) angelegt, wenn dieser&nbsp; eine Registernummer
tr&auml;gt, die sich von den Registernummern aller anderen
Nutzerdatens&auml;tze unterscheidet.<br>
    <br>
Bei der manuellen Dateneingabe per OUS besteht die oben beschriebene
Einschr&auml;nkung jedoch nicht. Wurden die Nutzer bislang manuell
eingegeben, so kann es vorkommen, da&szlig; dieses Feld bisher
anderweitig genutzt wurde. Die Verwendung dieses Feldes mu&szlig; dann
gegebenenfalls angepa&szlig;t und Altdatens&auml;tze entsprechend
modifiziert werden.<br>
    <br>
Beispielsweise wurde in Braunschweig&nbsp; als Registriernummer die
Matrikelnummer verwendet; bei au&szlig;eruniversit&auml;ren Nutzer
blieb das Feld leer. F&uuml;r die Online-Anmeldung<code></code> war es
nun notwendig, in solchen F&auml;llen eine (individuelle)
Pseudo-Matrikelnummer zuzuordnen.<br>
    <br>
Der Code im Anmelde-Modul stellt durch eine PICA-Datenbankabfrage
sicher, da&szlig; die Registernummer korrekt gew&auml;hlt wurde;
andernfalls bricht der PICA-Import mit einer Fehlermeldung ab. Ein
versehentliches &Uuml;berschreiben bereits existierender
PICA-Datens&auml;tze ist also in keinem Fall m&ouml;glich.<br>
    <br>
  </li>
  <li>Einige Benutzer beantragen zwar einen Nutzerausweis, holen diesen
jedoch auch nach l&auml;ngerer Zeit nicht ab. Die MySQL-Datenbank
f&uuml;llt sich daher immer mehr mit &auml;lteren Datens&auml;tzen.
Deshalb wird bei der Anmeldung das Eingabedatum registriert. Es ist
somit leicht m&ouml;glich, unbearbeitete Datens&auml;tze entweder
manuell oder aber automatisch nach einer festgelegten Frist zu
l&ouml;schen.<br>
  </li>
</ul>
<h3>Weiterf&uuml;hrende Informationen</h3>
Das System ist seit M&auml;rz 2004 an der UB
Braunschweig im Produktivbetrieb, und hat die bisherige Anmeldung per
Papierformular vollst&auml;ndig ersetzt. Es wurde von den
Benutzern und Mitarbeitern in k&uuml;rzester Zeit angenommen und
l&auml;uft seit seiner Einf&uuml;hrung st&ouml;rungsfrei. <br>
&nbsp;<br>
Die UB Braunschweig gibt dieses System an interessierte Bibliotheken
kostenfrei weiter.&nbsp; Bitte wenden Sie sich hierzu an den Direktor
der Bibliothek, Prof. Dr. Brandes
&lt;d.brandes@tu-bs.de&gt;.<br>
<br>
Die Installation erfordert Systemkenntnisse
in Unix, PHP, MySQL, und PICA, und ist in der <a href="INSTALL.html">Installationsanleitung
</a>beschrieben.<br>
<br>
Die Funktionsweise der PHP-Skripte ist in der <a
 href="internal/html/index.html">internen Systemdokumentation</a>
genauer beschrieben. <br>
<h3><a>Literatur</a></h3>
<a name="1"></a> [1] OCLC PICA. <a href="http://www.oclcpica.org/">http://www.oclcpica.org</a><br>
<a name="2"></a> [2] Homepage des Gemeinsamen Bibliotheksverbundes
(GBV). <a href="http://www.gbv.de/">http://www.gbv.de</a><br>
<a name="3"></a> [3] The Open Source Initiative (OSI). <a
 href="http://www.opensource.org/">http://www.opensource.org</a><br>
<a name="4"></a> [4] The Apache Web Server Project. <a
 href="http://httpd.apache.org/">http://httpd.apache.org</a> <br>
<a name="5"></a> [5] MySQL Homepage. <a href="http://www.mysql.com/">http://www.mysql.com</a><br>
<a name="6"></a> [6] PHP: Hypertext Preprocessor. <a
 href="http://www.php.net/">http://www.php.net</a><br>
<a name="7"></a> [7] PICA-LBS-3-Ausleihsystem (OUS): OUS_F. Anleitung
zur Systemverwaltung. Gemeinsamer Bibliotheksverbund (GBV), Januar 2001.<br>
<br>
</body>
</html>
